floshardmd removed
